PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc17xx/lpc17_usb.h
#define OTGI2C_CLKHI_SHIFT               (0)       /* Bits 0-7: Clock divisor high */
#define OTGI2C_CLKHI_MASK                (0xff << OTGI2C_CLKHI_SHIFT)
                                                   /* Bits 8-31: Reserved */
/* I2C Clock Low */

#define OTGI2C_CLKLO_SHIFT               (0)       /* Bits 0-7: Clock divisor high */
#define OTGI2C_CLLO_MASK                 (0xff << OTGI2C_CLKLO_SHIFT)
                                                   /* Bits 8-31: Reserved */
/* Clock control registers ***********************************************************/

/* USB Clock Control (OTG clock controller) and USB Clock Status (OTG clock status) */

#define USBDEV_CLK_HOSTCLK               (1 << 0)  /* Bit 1:  Host clock (OTG only) */
#define USBDEV_CLK_DEVCLK                (1 << 1)  /* Bit 1:  Device clock */
#define USBDEV_CLK_I2CCLK                (1 << 2)  /* Bit 2:  I2C clock (OTG only) */
#define USBDEV_CLK_PORTSELCLK            (1 << 3)  /* Bit 3:  Port select register clock (device only) */
#define USBDEV_CLK_OTGCLK                (1 << 3)  /* Bit 3:  OTG clock (OTG only) */
#define USBDEV_CLK_AHBCLK                (1 << 4)  /* Bit 4:  AHB clock */
                                                   /* Bits 5-31: Reserved */
/* Alternate naming */

#define USBOTG_CLK_HOSTCLK               USBDEV_CLK_HOSTCLK
#define USBOTG_CLK_DEVCLK                USBDEV_CLK_DEVCLK
#define USBOTG_CLK_I2CCLK                USBDEV_CLK_I2CCLK
#define USBOTG_CLK_PORTSELCLK            USBDEV_CLK_PORTSELCLK
#define USBOTG_CLK_OTGCLK                USBDEV_CLK_OTGCLK
#define USBOTG_CLK_AHBCLK                USBDEV_CLK_AHBCLK

/* Endpoints *************************************************************************/

#define LPC17_EP0_OUT                    0
#define LPC17_EP0_IN                     1
#define LPC17_CTRLEP_OUT                 LPC17_EP0_OUT
#define LPC17_CTRLEP_IN                  LPC17_EP0_IN
#define LPC17_EP1_OUT                    2
#define LPC17_EP1_IN                     3
#define LPC17_EP2_OUT                    4
#define LPC17_EP2_IN                     5
#define LPC17_EP3_OUT                    6
#define LPC17_EP3_IN                     7
#define LPC17_EP4_OUT                    8
#define LPC17_EP4_IN                     9
#define LPC17_EP5_OUT                    10
#define LPC17_EP5_IN                     11
#define LPC17_EP6_OUT                    12
#define LPC17_EP6_IN                     13
#define LPC17_EP7_OUT                    14
#define LPC17_EP7_IN                     15
#define LPC17_EP8_OUT                    16
#define LPC17_EP8_IN                     17
#define LPC17_EP9_OUT                    18
#define LPC17_EP9_IN                     19
#define LPC17_EP10_OUT                   20
#define LPC17_EP10_IN                    21
#define LPC17_EP11_OUT                   22
#define LPC17_EP11_IN                    23
#define LPC17_EP12_OUT                   24
#define LPC17_EP12_IN                    25
#define LPC17_EP13_OUT                   26
#define LPC17_EP13_IN                    27
#define LPC17_EP14_OUT                   28
#define LPC17_EP14_IN                    29
#define LPC17_EP15_OUT                   30
#define LPC17_EP15_IN                    31
#define LPC17_NUMEPS                     32

/* Commands *************************************************************************/

/* USB Command Code Register */

#define CMD_USBDEV_PHASESHIFT            (8)       /* Bits 8-15: Command phase value */
#define CMD_USBDEV_PHASEMASK             (0xff << CMD_USBDEV_PHASESHIFT)
#  define CMD_USBDEV_DATAWR              (1 << CMD_USBDEV_PHASESHIFT)
#  define CMD_USBDEV_DATARD              (2 << CMD_USBDEV_PHASESHIFT)
#  define CMD_USBDEV_CMDWR               (5 << CMD_USBDEV_PHASESHIFT)
#define CMD_USBDEV_CMDSHIFT              (16)      /* Bits 16-23: Device command/WDATA */
#define CMD_USBDEV_CMDMASK               (0xff << CMD_USBDEV_CMDSHIFT)
#define CMD_USBDEV_WDATASHIFT            CMD_USBDEV_CMDSHIFT
#define CMD_USBDEV_WDATAMASK             CMD_USBDEV_CMDMASK

/* Device Commands */

#define CMD_USBDEV_SETADDRESS            (0x00d0)
#define CMD_USBDEV_CONFIG                (0x00d8)
#define CMD_USBDEV_SETMODE               (0x00f3)
#define CMD_USBDEV_READFRAMENO           (0x00f5)
#define CMD_USBDEV_READTESTREG           (0x00fd)
#define CMD_USBDEV_SETSTATUS             (0x01fe) /* Bit 8 set to distingish get from set */
#define CMD_USBDEV_GETSTATUS             (0x00fe)
#define CMD_USBDEV_GETERRORCODE          (0x00ff)
#define CMD_USBDEV_READERRORSTATUS       (0x00fb)

/* Endpoint Commands */

#define CMD_USBDEV_EPSELECT              (0x0000)
#define CMD_USBDEV_EPSELECTCLEAR         (0x0040)
#define CMD_USBDEV_EPSETSTATUS           (0x0140) /* Bit 8 set to distingish get from selectclear */
#define CMD_USBDEV_EPCLRBUFFER           (0x00f2)
#define CMD_USBDEV_EPVALIDATEBUFFER      (0x00fa)

/* Command/response bit definitions ********************************************/
/* SETADDRESS (0xd0) command definitions */

#define CMD_USBDEV_SETADDRESS_MASK       (0x7f)    /* Bits 0-6: Device address */
#define CMD_USBDEV_SETADDRESS_DEVEN      (1 << 7)  /* Bit 7:  Device enable */

/* SETSTATUS (0xfe) and GETSTATUS (0xfe) response: */

#define CMD_STATUS_CONNECT               (1 << 0)  /* Bit 0:  Connected */
#define CMD_STATUS_CONNCHG               (1 << 1)  /* Bit 1:  Connect change */
#define CMD_STATUS_SUSPEND               (1 << 2)  /* Bit 2:  Suspend */
#define CMD_STATUS_SUSPCHG               (1 << 3)  /* Bit 3:  Suspend change */
#define CMD_STATUS_RESET                 (1 << 4)  /* Bit 4:  Bus reset bit */

/* EPSELECT (0x00) endpoint status response */

#define CMD_EPSELECT_FE                  (1 << 0)  /* Bit 0:  IN empty or OUT full */
#define CMD_EPSELECT_ST                  (1 << 1)  /* Bit 1:  Endpoint is stalled */
#define CMD_EPSELECT_STP                 (1 << 2)  /* Bit 2:  Last packet was setup */
#define CMD_EPSELECT_PO                  (1 << 3)  /* Bit 3:  Previous packet was overwritten */
#define CMD_EPSELECT_EPN                 (1 << 4)  /* Bit 4:  NAK sent */
#define CMD_EPSELECT_B1FULL              (1 << 5)  /* Bit 5:  Buffer 1 full */
#define CMD_EPSELECT_B2FULL              (1 << 6)  /* Bit 6:  Buffer 2 full */
                                                   /* Bit 7:  Reserved */
/* EPSETSTATUS (0x40) command */

#define CMD_SETSTAUS_ST                  (1 << 0)  /* Bit 0:  Stalled endpoint bit */
                                                   /* Bits 1-4: Reserved */
#define CMD_SETSTAUS_DA                  (1 << 5)  /* Bit 5:  Disabled endpoint bit */
#define CMD_SETSTAUS_RFMO                (1 << 6)  /* Bit 6:  Rate feedback mode */
#define CMD_SETSTAUS_CNDST               (1 << 7)  /* Bit 7:  Conditional stall bit */

/* EPCLRBUFFER (0xf2) response */

